In [2]:
import pandas as pd
import numpy as np
from  numpy import nan as NA

In [3]:
series_data = pd.Series(['Prince','Hari',np.nan,'Love'])

In [4]:
series_data

0    Prince
1      Hari
2       NaN
3      Love
dtype: object

In [5]:
#Null Data Handle
series_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
series_data.dropna().count() #series_data.dropna()

3

In [9]:
series_data.fillna(value='Ravi')

0    Prince
1      Hari
2      Ravi
3      Love
dtype: object

In [10]:
series_data.fillna(method='ffill') #or 'bfill'

0    Prince
1      Hari
2      Hari
3      Love
dtype: object

In [11]:
series_data[series_data.isnull()]

2    NaN
dtype: object

In [12]:
series_data[series_data.notnull()]

0    Prince
1      Hari
3      Love
dtype: object

In [23]:
df = pd.DataFrame(np.random.randn(3,7))
df

          0         1         2         3         4         5         6
0  1.353064 -0.712581 -0.412010 -0.739011  0.509867 -1.245885 -0.158897
1 -0.044125 -0.602102  2.168101 -0.648119  0.631598 -0.869020  0.892562
2 -1.590335 -0.524566 -0.539839 -0.519115 -0.702827 -1.279062  1.727604

In [33]:
df.iloc[1:,4:]=NA

In [35]:
df

          0         1         2         3         4         5         6
0  1.353064 -0.712581 -0.412010 -0.739011  0.509867 -1.245885 -0.158897
1 -0.044125 -0.602102  2.168101 -0.648119       NaN       NaN       NaN
2       NaN       NaN       NaN       NaN       NaN       NaN       NaN

In [36]:
df.fillna(0)

          0         1         2         3         4         5         6
0  1.353064 -0.712581 -0.412010 -0.739011  0.509867 -1.245885 -0.158897
1 -0.044125 -0.602102  2.168101 -0.648119  0.000000  0.000000  0.000000
2  0.000000  0.000000  0.000000  0.000000  0.000000  0.000000  0.000000

In [37]:
df.fillna({1:0,2:.5})

          0         1         2         3         4         5         6
0  1.353064 -0.712581 -0.412010 -0.739011  0.509867 -1.245885 -0.158897
1 -0.044125 -0.602102  2.168101 -0.648119       NaN       NaN       NaN
2       NaN  0.000000  0.500000       NaN       NaN       NaN       NaN

In [40]:
#Data Transformation
#Duplication
data = pd.DataFrame({'k':['one','two']*3+['two'],
                    'k1':[1,1,2,3,3,4,4]})
data

     k  k1
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [41]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [42]:
data.drop_duplicates()

     k  k1
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [43]:
data['v1']=range(7)

In [44]:
data

     k  k1  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [46]:
data.drop_duplicates(['k1'])

     k  k1  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [51]:
#Transform using function
data  =pd.DataFrame({'food':['Roti','sabji','salad','achar','papad'],
                    'rates':[2,4,3,6,2]})
data

    food  rates
0   Roti      2
1  sabji      4
2  salad      3
3  achar      6
4  papad      2

In [52]:
data['food'] = data['food'].str.lower()
data

    food  rates
0   roti      2
1  sabji      4
2  salad      3
3  achar      6
4  papad      2

In [56]:
food_place = {'roti':'farm','sabji':'farm','achar':'shop','papad':'factory','salad':'farm'}

In [57]:
data['place']=data['food'].map(food_place)

In [58]:
data

    food  rates    place
0   roti      2     farm
1  sabji      4     farm
2  salad      3     farm
3  achar      6     shop
4  papad      2  factory

In [71]:
#Replacing Values
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [72]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [73]:
data.replace(-999,0)

0       1.0
1       0.0
2       2.0
3       0.0
4   -1000.0
5       3.0
dtype: float64

In [74]:
data.replace([1,3],0)

0       0.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       0.0
dtype: float64

In [76]:
data.replace({-999:2,0:5})

0       1.0
1       2.0
2       2.0
3       2.0
4   -1000.0
5       3.0
dtype: float64

In [77]:
#Renaming Axis Indexes

In [78]:
#Discretization and Binning
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages,bins)

cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [79]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [81]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [82]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [84]:
#Detecting and Filtering Outliers
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.002204     0.009978     0.009169     0.031264
std       1.003698     1.029364     1.008138     0.999940
min      -3.068449    -4.185447    -2.873393    -2.911188
25%      -0.687625    -0.680013    -0.660603    -0.687581
50%      -0.040043    -0.008776     0.076981    -0.004829
75%       0.648415     0.666451     0.657399     0.759983
max       3.296988     3.294365     3.746302     3.177079

In [85]:
col = data[2]

In [91]:
col[np.abs(col)>3]

179    3.089736
553    3.420278
781    3.746302
Name: 2, dtype: float64

In [7]:
var = 'a,b,  rrr'
arr=var.split(',')
arr[0]+"::"+arr[1]+"::"+arr[2].strip()

'a::b::rrr'

In [8]:
#Regular Expression
import re 
text = "foo bar\t baz \tqux"

In [9]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [13]:
re.findall("\t",text)

['\t', '\t']

In [14]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Za-z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [15]:
regex = re.compile(pattern,flags=re.IGNORECASE)

In [16]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [17]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern,flags=re.IGNORECASE)

In [20]:
print(regex.sub(r'Username: \1,Domain: \2,Suffix: \3',text))

Dave Username: dave,Domain: google,Suffix: com
Steve Username: steve,Domain: gmail,Suffix: com
Rob Username: rob,Domain: gmail,Suffix: com
Ryan Username: ryan,Domain: yahoo,Suffix: com